# YOLOv9
 
# parameters
nc: 7  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()
 
# anchors
anchors: 3
 
# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4
   # elan-1 block
   [-1, 1, GFFM, [256, 128, 64, 1]],  # 3
   # conv down
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8
   # elan-2 block
   [-1, 1, GFFM, [512, 256, 128, 1]],  # 5
   # conv down
   [-1, 1, Conv, [512, 3, 2]],  # 6-P4/16
   # elan-2 block
   [-1, 1, GFFM, [512, 512, 256, 1]],  # 7
   # conv down
   [-1, 1, Conv, [512, 3, 2]],  # 8-P5/32
   # elan-2 block
   [-1, 1, GFFM, [512, 512, 256, 1]],  # 9
  ]
 
# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 10
   [ -1, 1, Conv, [ 512, 1, 1 ] ], # 11
   [ 5, 1, Conv, [ 512, 1, 1 ] ], # 12
   [ [ -1, 7, -2 ], 1, Zoom_cat, [ ] ],  # 13 cat backbone P4
   [ -1, 1, GFFM, [512, 512, 256, 1]],  # 14
 
   [ -1, 1, Conv, [ 256, 1, 1 ] ], # 15
   [ 3, 1, Conv, [ 256, 1, 1 ] ], # 16
   [ [ -1, 5, -2 ], 1, Zoom_cat, [ ] ],  # 17  cat backbone P3
   [ -1, 1, GFFM, [256, 128, 64, 1]],  # 18 (P3/8-small)
 
   [ -1, 1, Conv, [ 256, 3, 2 ] ], # 19
   [ [ -1, 15 ], 1, Concat, [ 1 ] ],  # 20 cat head P4
   [ -1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 21 (P4/16-medium)
 
   [ -1, 1, Conv, [ 512, 3, 2 ] ], # 22
   [ [ -1, 11 ], 1, Concat, [ 1 ] ],  # 23 cat head P5
   [ -1, 1, GFFM, [512, 512, 256, 1]],  # 24 (P5/32-large)
 
   [ [ 5, 7, 9 ], 1, ScalSeq, [ 256 ] ], # 25 args[inchane]
   [ [18, -1], 1, attention_model, [256]], # 26
 
   # routing + 4
   [5, 1, CBLinear, [[256]]], # 27
   [7, 1, CBLinear, [[256, 512]]], # 28
   [9, 1, CBLinear, [[256, 512, 512]]], # 29
   
   # conv down
   [0, 1, Conv, [64, 3, 2]],  # 30-P1/2
 
   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 31-P2/4
 
   # elan-1 block
   [-1, 1, GFFM, [256, 128, 64, 1]],  # 32
 
   # conv down fuse
   [-1, 1, Conv, [256, 3, 2]],  # 33-P3/8
   [[27, 28, 29, -1], 1, CBFuse, [[0, 0, 0]]], # 34
 
   # elan-2 block
   [-1, 1, GFFM, [512, 256, 128, 1]],  # 35
 
   # conv down fuse
   [-1, 1, Conv, [512, 3, 2]],  # 36-P4/16
   [[28, 29, -1], 1, CBFuse, [[1, 1]]], # 37
 
   # elan-2 block
   [-1, 1, GFFM, [512, 512, 256, 1]],  # 38
 
   # conv down fuse
   [-1, 1, Conv, [512, 3, 2]],  # 39-P5/32
   [[29, -1], 1, CBFuse, [[2]]], # 40
 
   # elan-2 block
   [-1, 1, GFFM, [512, 512, 256, 1]],  # 41
 
   # detect
   [[35, 38, 41, 25, 24, 21], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]